[{"ownerid":1,"name":"Sheila","type":"Dog","primarybreed":"Husky","sex":"F","age":"Adult","description":"Sheila is a fun-loving high energy girl.  She is looking for an active family, preferably with a fenced in yard.  She is waiting for a family to call her own,","contact":{"phone":"712-246-3236   ","state":"IA","address1":"Box 221","address2":"506 Park","email":"s.hoefing@mchsi.com","city":"Shenandoah","zip":"51601","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/38449758/1/?bust=1497484439&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38449758/1/?bust=1497484439&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38449758/2/?bust=1508963793&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38449758/2/?bust=1508963793&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38449758/3/?bust=1508963794&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38449758/3/?bust=1508963794&width=300&-pn.jpg"]},{"ownerid":1,"name":"Lovely Loa","type":"Dog","primarybreed":"Husky","sex":"F","age":"Young","description":"Hi! My name is Lovely Loa and I am looking for a loving, forever home.  I was rescued from the streets of Puerto Rico where I was abandoned and left to fend for myself.  My rescuer loved and cared for me until I was ready to take our liberation flight.\n\nMy foster family says I am a very sweet playful dog :).  I am loving to people and good with other dogs.  I have lots of energy so would love a home with a fully fenced in yard where I can run around and play and go hiking or running with my new family.  When I am done playing I really enjoy cuddling on the couch for lots of love and affection :)).\n\nI am 1.5 years old, 42 lbs., spayed, fully vetted and vaccinated.\n\nIf you are interested in learning more about me please email merylwright@aol.com.\n\nCan't wait to meet you.  Love and Kisses Lovely Loa :))","contact":{"phone":"","state":"MA","address1":"","address2":"","email":"merylwright@aol.com","city":"Randolph","zip":"02368","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41348808/1/?bust=1523105738&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41348808/1/?bust=1523105738&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41348808/2/?bust=1523105748&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41348808/2/?bust=1523105748&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41348808/3/?bust=1523105756&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41348808/3/?bust=1523105756&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41348808/4/?bust=1523105764&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41348808/4/?bust=1523105764&width=300&-pn.jpg"]},{"ownerid":1,"name":"Sampson","type":"Dog","primarybreed":"Golden Retriever","sex":"M","age":"Baby","description":"One of Kimmy's puppies\n\nSampson gets along well with others.  He is a little shy around strangers but just needs a few days to warm up to you.\n\n\nClick here to complete the adoption questionnaire (link at the top of the page) and email it to: kim@dogsrus.orgVisit our Website for more information about our shelter, adoption policies, and procedures.\n ","contact":{"phone":"","state":"TX","address1":"PO Box 494","address2":"","email":"Kim@dogsrus.org","city":"Floresville","zip":"78114","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/29682223/1/?bust=1495847928&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/29682223/1/?bust=1495847928&width=300&-pn.jpg"]},{"ownerid":1,"name":"Lefty","type":"Dog","primarybreed":"Yorkshire Terrier Yorkie","sex":"M","age":"Adult","description":"NEW INTAKE: Lefty - male - approx 5 years old - 9.2 pounds - Yorkie/Dachshund mix\n\nReason for intake: Lefty came to us from Caddo Parish Animal Services. He was super-scared in his kennel and we thought he was going to try to bite us at first... but instead, he rolled over on his back in a submissive manner. It was so sad. We scooped him up and took him with us. He's got short little legs and a long body like a Dachshund, but sort of looks like a Yorkie. He's currently at our vet for neutering, vaccinations, heartworm/fecal testing, etc.\n\nMore pics and a full write-up will be posted in the next few days.\n\nAdoption fee $170, which includes microchipping and enrollment fee.\n\nTo pre-apply, click here: http://www.roadtorescuela.org/dog-application\n\nOnly adopters with a responsible dog ownership history, along with an excellent vet reference need apply.\n\nIf youâd like to help us continue to save shelter dogs and cats in need, please Paypal your donation to www.paypal.me/NR2R, OR click on the donate button on our Facebook page, OR visit our website at www.RoadtoRescueLA.org and click on the donate button. We can only continue our good work through donations from the community. Thank you for your support!\n\n**IMPORTANT NOTES**\n\n*All of our adoptable dogs are small, and they are never to be left outside alone, ever! We only rehome our dogs to adopters that plan to have them as inside dogs and part of the family! We do allow adopters with doggie doors, provided there is SECURE fencing. There is no exception to this rule!\n\n*NO SMALL CHILDREN!! As with almost all the dogs at NR2R, young children or a very active household is not recommended. Many of our dogs come to us BECAUSE of small children, thus we do not rehome our dogs to homes with babies or young children. Even if the children are older, it would depend on the child AND the parent or parents.\n\n*We do not guarantee that any of our adoptable dogs are housetrained. While most should be easily trained, keep in mind that they live in a rescue where they have access to the outdoors all day and are inside at night. Even if they were surrendered to us as housetrained, it doesnât mean they will automatically be housetrained in your home. Housetraining them should be easy in the right home with time, patience, and consistency.\n\n*Only adopters with a responsible dog ownership history and excellent vet reference need apply. If you bring this pet into your heart and home, you will receive in return many years of love, companionship, and loyalty. Thatâs our guarantee. 4/13/18 12:36 PM","contact":{"phone":"(318) 617-8670","state":"LA","address1":"","address2":"","email":"roadtorescue@bellsouth.net","city":"Benton","zip":"71006","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41385661/1/?bust=1523519549&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41385661/1/?bust=1523519549&width=300&-pn.jpg"]},{"ownerid":5,"name":"Scat","type":"Cat","primarybreed":"Domestic Short Hair","sex":"F","age":"Adult","description":"Scat is a scardy cat. She was born in the spring of 2010 and is one of Miss Gulch's kittens. She is feral and she has stuck pretty close to her. With some work and time she can be handleable. We've gotten her better than she was, but still a long way to go.\n\nPlease call if you want more information on her.\n\nShe has been tested, spayed, fully vaccinated, wormed and flea treated. \n\nHer adoption fee is $75 and a veterinary reference is required.","contact":{"phone":"(419) 289-3658","state":"OH","address1":"1130 E. Main Street #136","address2":"","email":"thecathousesanctuary@zoominternet.net","city":"Ashland","zip":"44805","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/17293958/2/?bust=1423414237&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/17293958/2/?bust=1423414237&width=300&-pn.jpg"]},{"ownerid":1,"name":"Rosa* A148237","type":"Dog","primarybreed":"German Shepherd Dog","sex":"F","age":"Young","description":"VIP: Rosa is a sweet dog who is very playful. She is so smart too and knows how to sit.  Rosa is very affectionate and loves to go for walks. She is about 18 months of age and will make a great companion for anyone. \nAdopted animals are not able to go to their new home until spay and neuter surgery has been done. When calling or emailing about an animal, please be sure to use the animal identification number that starts with A.","contact":{"phone":"(972) 769-4360","state":"TX","address1":"4028 Plano Parkway","address2":"","email":"debbien@plano.gov","city":"Plano","zip":"75093","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41106510/1/?bust=1520880094&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41106510/1/?bust=1520880094&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41106510/2/?bust=1520880095&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41106510/2/?bust=1520880095&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41106510/3/?bust=1520880095&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41106510/3/?bust=1520880095&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41106510/4/?bust=1520880095&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41106510/4/?bust=1520880095&width=300&-pn.jpg"]},{"ownerid":1,"name":"Reba","type":"Dog","primarybreed":"Boxer","sex":"F","age":"Baby","contact":{"phone":"(980) 439-6505","state":"NC","address1":"","address2":"","email":"mtpleasantanimalrescue@aol.com","city":"Mount Pleasant","zip":"28124","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/40550285/1/?bust=1514685873&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40550285/1/?bust=1514685873&width=300&-pn.jpg"]},{"ownerid":1,"name":"Suzie","type":"Dog","primarybreed":"Hound","sex":"F","age":"Young","description":"Hi, my name is Susie! I'm a 2 year old hound mix. I am extremely sweet and compliant, and am very eager-to-please. I'm so calm and laid back!   I'm just about the sweetest dog you could hope for. I'm very submissive, and seem to live to please people. I have the typical easygoing, goofy hound temperament, and am very friendly! I'm very affectionate and love attention.  I will follow you anywhere, and just love to be close to people. I seem to know all of my doggy manners... I am very polite, and walk well on a leash. I'm a true Southern Belle. Not only that, but I am current on all my vaccinations and am already spayed. I'm the whole package! I'm looking for my forever family... could it be you?","contact":{"phone":"828 883-3713","state":"NC","address1":"1124 Old Rosman Hwy","address2":"","email":"malmin@citcom.net","city":"Brevard","zip":"28712","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41193470/1/?bust=1521210536&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41193470/1/?bust=1521210536&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41193470/2/?bust=1521210587&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41193470/2/?bust=1521210587&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41193470/3/?bust=1521210644&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41193470/3/?bust=1521210644&width=300&-pn.jpg"]},{"ownerid":2,"name":"BISCUIT","type":"Dog","primarybreed":"Terrier","sex":"F","age":"Young","description":"Hi!  My name is Biscuit and I am a spayed female terrier mix.  The shelter thinks I am about 2 years old.  I was very frightened when my foster mommy brought me home.  I wouldn't even let her pick me up.  Now I am a happy, playful and very smart little girl.  I am fully crate trained and sleep all night without a peep!  I travel well, and do great on a leash.  I love to go on long walks with my foster mom.  I do well with other small dogs and older children.  I am fully potty trained, and let my mom know when I need to go out.  I love to sit on a lap, but I sleep mostly on my little dog mat on the floor.  I love treats, and learn quickly.","contact":{"phone":"(916) 808-7387","state":"CA","address1":"2127 Front Street","address2":"","email":"animalcare@cityofsacramento.org","city":"Sacramento","zip":"95818","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41193009/1/?bust=1521211103&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41193009/1/?bust=1521211103&width=300&-pn.jpg"]},{"ownerid":2,"name":"Jake","type":"Dog","primarybreed":"Chow Chow","sex":"M","age":"Senior","description":"Jake is a mellow, friendly soul who just needs a comfortable place to call home. Jake gets along well with all other dogs, cats, adults and older, respectful children. He is very good on leash and enjoys a nice walk daily. If you need a big teddy bear in your life, Jake is your guy. He said to add that he also likes treats and cuddles.\n\nJake is 10 years old, 50 pounds, and ready for his forever home! 4/11/18 12:26 AM","contact":{"phone":"(213) 282-7297","state":"CA","address1":"","address2":"","email":"adopt@liveloveanimalrescue.org","city":"Long Beach","zip":"90807","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41367388/1/?bust=1523338666&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41367388/1/?bust=1523338666&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41367388/2/?bust=1523338667&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41367388/2/?bust=1523338667&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41367388/3/?bust=1523338667&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41367388/3/?bust=1523338667&width=300&-pn.jpg"]},{"ownerid":4,"name":"Cora","type":"Dog","primarybreed":"Boxer","sex":"F","age":"Adult","description":"**Cora is currently being fostered in Houston, TX. Cora's local adoption fee, with local area pick up, is $300. Because foster and vet care are so expensive, the adoption fee is non-negotiable.**\n\nOur beautiful Cora came off the streets of Houston in really poor condition â in fact, when we rescued her we thought the only thing we could do for her was peacefully let her go with some love and dignity. Much to our delight, our vet told us that everything wrong was superficial and we would be able to save her! After getting her healthy and up to weight, we are so excited to find her forever family for her! \n\nCora is a roughly 3-year old, 80-pound Boxer/American Bulldog mix. Because many apartment/condo management companies have restrictions against her breed, it is best to check about potential breed regulations prior to applying. Cora is an medium level activity and SMART girl who will be best suited in a family that can commit to proper exercise and socialization. She is amazing, but to be her best, she needs exercise and stimulation. \n\nCora currently lives with other dogs and LOVES having a playmates. Since she is a bigger girl, we would advocate she not live with small dogs just because of her size, she may inadvertently hurt a small companion. She has a high prey drive â from her time surviving on the streets â so she CANNOT live with cats. She would be great as a single dog or as an addition to a family with another active dog. \n\nCora has a great disposition and would be a great addition to a family with children who know how to be kind and respectful of animals. But with her size, we would advocate she be placed in a home with older children. \n\nCora is house and kennel trained and has done a great job of learning how to walk on her leash. She loves going on adventures with her foster family and is a great co-pilot in the car.  \n\nCoraâs ideal family will understand that she will take time and patience as she acclimates into her new life. She may have accidents, chew on things she is not supposed to, and bark in her kennel. It can take dogs a few weeks to properly acclimate to their new lives, so she is seeking a family that can give her this time and work with her on becoming an even more awesome dog than she already is. \n\nCora should be adopted by a family who plans to keep her indoors as part of a family - we do not adopt dogs into situations in which they will be left outside for extended periods of time unattended (for example, the entire work day).\n\nCora is fully vetted (spayed, microchipped, vaccinated)  and has no known allergies. Unfortunately because of Coraâs time on the street, she is heartworm positive. She has been started on a slow-kill heartworm protocol and the medication to continue her treatment will be provided by the rescue. This does not impact the quality of her life, itâs just something that needs consistency of medication until itâs cleared up. \n\nThe first step in our adoption process is to fill out an application via our website which you can access via the following link: https://reggiesfriends.org/adoptables/\n\nIf you have questions about Cora, please email us at adoptions@reggiesfriends.org for more information.","contact":{"phone":"","state":"TX","address1":"PO Box 2573","address2":"","email":"adoptions@reggiesfriends.org","city":"Conroe","zip":"77306","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/40669370/1/?bust=1515957165&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40669370/1/?bust=1515957165&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40669370/2/?bust=1515957170&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40669370/2/?bust=1515957170&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40669370/3/?bust=1515957171&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40669370/3/?bust=1515957171&width=300&-pn.jpg"]},{"ownerid":2,"name":"Max","type":"Dog","primarybreed":"Great Dane","sex":"M","age":"Young","contact":{"phone":"(620) 221-1698","state":"KS","address1":"7648 222nd Rd","address2":"","email":"ccasdirector@skyerock.net","city":"Winfield","zip":"67156","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41102206/1/?bust=1520203031&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41102206/1/?bust=1520203031&width=300&-pn.jpg"]},{"ownerid":2,"name":"Sally","type":"Dog","primarybreed":"Dachshund","sex":"F","age":"Adult","description":"You can fill out an adoption application online on our official website.Sally is my pally!! She is an adorable chi-weenie who is as tiny and dainty as a daisy in an open field. She loves kids, cats, other dogs, chickens, and anyone who will give her some love. She loves being played guitar and being sung to sleep. She has cute puppy dreams and cuddles like a newborn child on a cold night. She loves to play outside when yard work is getting done, but when its time to go in, shes ready for a lap to lay on! 4/6/18 12:20 AM","contact":{"phone":"(850) 960-4543","state":"FL","address1":"","address2":"","email":"adopt.heartlandrr@gmail.com","city":"Panama City","zip":"32409","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41339838/1/?bust=1523018123&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41339838/1/?bust=1523018123&width=300&-pn.jpg"]},{"ownerid":3,"name":"Bagel","type":"Dog","primarybreed":"Akita","sex":"M","age":"Adult","description":"Bagel is a gorgeous big boy, labelled as an Akita/GSD mix by the shelter he was rescued from - we tested his DNA, and results stated he is (in order of strength of the results) Akita, Jindo, Shar Pei.\nHe's about 10 years old, and weighs around 82lbs.\n\nBagel is a friendly, playful boy, who appears to get along with everyone, and other dogs too. As yet we have not tested him with children or small critters.\n\n(The third picture shows Bagel on the right with his Jindo foster brother).\n\nHe is learning to walk nicely on a leash, and his basic commands.\nHe's already had his teeth cleaned and a successful check up at the vet - he does not, however, enjoy the vet visits a whole lot, though he has improved a lot...!\n\nContact us to find out more about him!\nAdoption fees are $250.00.\nVisit our website to complete an application form: www.twodogfarms.com.\n\ninfo@twodogfarms.com","contact":{"phone":"7756360036  ","state":"CA","address1":"","address2":"","email":"info@twodogfarms.com","city":"Los Angeles","zip":"90019","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/34146156/1/?bust=1452342095&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/34146156/1/?bust=1452342095&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/34146156/2/?bust=1451738092&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/34146156/2/?bust=1451738092&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/34146156/3/?bust=1452189296&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/34146156/3/?bust=1452189296&width=300&-pn.jpg"]},{"ownerid":1,"name":"IRISH","type":"Dog","primarybreed":"Catahoula Leopard Dog","sex":"M","age":"Adult","description":"If you are looing for an active dog to add to your family, then Irish is the one for you!  This happy go lucky guy loves to run and play and would enjoy a new forever home with a large yard that he could call his own.  He has gorgeous catahoula markings and one blue eye that will draw you to him.  Please give Irish the second chance that he deserves!  **WE RECOMMEND THAT IF ANY POTENTIAL ADOPTER HAS OTHER DOGS OR CATS, TO PLEASE  BRING THEM IN FOR A MEET AND GREET BEFORE ADOPTING A SHELTER PET....","contact":{"phone":"405-216-7615 ","state":"OK","address1":"2424 Old Timbers Drive","address2":"","email":"ila.lee@edmondok.com","city":"Edmond","zip":"73034","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41239086/1/?bust=1521780413&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41239086/1/?bust=1521780413&width=300&-pn.jpg"]},{"ownerid":3,"name":"SONY","type":"Dog","primarybreed":"American Staffordshire Terrier","sex":"F","age":"Young","description":"Meet SONY, a two year old dog who escaped death at the NYC shelter.  She was surrendered to the shelter by her owner who stated 'personal problems'.   SONY is a very sweet, small, active and friendly dog.  She lived with kids ages 12-16 and was relaxed, gentle and playful with them.   With other dogs, her owner described her as exuberant.  Her play-play-play style might not suit every dog.  SONY is friendly to all visitors to the home, or people who approach you on the street.  She LOVES to play with her Jolly Ball and play a game of fetch. \n\nSONY the dog for you?  She is a very sweet petite girl and would do well with someone who would like an exercise partner or someone who truly understands the exercise needs of a young dog.  Fenced yard would be ideal.  Kids 8+.  \n\nFill out the application to adopt SONY at www.thepolishedpitbull.com.  Click on ADOPT A DOG.","contact":{"phone":"","state":"PA","address1":"","address2":"","email":"ThePolishedPitbull@gmail.com","city":"Phoenixville","zip":"19460","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/36275256/1/?bust=1521199484&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/36275256/1/?bust=1521199484&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/36275256/2/?bust=1503515795&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/36275256/2/?bust=1503515795&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/36275256/4/?bust=1502762626&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/36275256/4/?bust=1502762626&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/36275256/5/?bust=1502762626&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/36275256/5/?bust=1502762626&width=300&-pn.jpg"]},{"ownerid":3,"name":"Hope","type":"Dog","primarybreed":"Shepherd","sex":"F","age":"Adult","description":"Good with Dogs: Yes\nGood with Cats: Unknown\nGood with Children: Yes, Older Children only\n\nDESCRIPTION\n\nHope is a super sweet but shy girl who was rescued from the streets of Dallas.  She was extremely skittish and shy when rescued and has come along way to learning to trust people. Her furry house mates continue to show her how great it is to be a family dog. \n\nHope is great with other dogs but can take a little while to feel comfortable around new furry friends. She does not react to them unless they try to get too close.  Sheâs nervous about bigger dogs but would most likely enjoy them as buddies too if given time and not forced to interact with them.  But once she knows they are friends, she warms up quickly. \n\nShe has worked hard on overcoming her insecurities and learning to trust people but would do best with an experienced patient family with older children.  \n\nHer foster family says she is quite vocal, including âyodelingâ at them when she wants to play. She will also let them know when someone comes to the door. \n\nShe is house-trained and kennel-trained, and does well on a leash.  She weighs approximately 40 pounds and is a medium-size dog. \n\nNot all animals attend every adoption event. Please contact us for more information on this dog.","contact":{"phone":"972-462-1121","state":"TX","address1":"PO Box 1561","address2":"","email":"moreinfo@coppellhumanesociety.com","city":"Coppell","zip":"75019","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41143339/1/?bust=1520652829&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41143339/1/?bust=1520652829&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41143339/2/?bust=1520652807&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41143339/2/?bust=1520652807&width=300&-pn.jpg"]},{"ownerid":4,"name":"Tern","type":"Dog","primarybreed":"Alaskan Malamute","sex":"F","age":"Baby","description":"You can fill out an adoption application online on our official website. 4/13/18 8:59 AM","contact":{"phone":"(907) 727-6728","state":"AK","address1":"2440 E. Tudor Road #105","address2":"","email":"rescueadogtoday@gmail.com","city":"Anchorage","zip":"99503","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41377646/1/?bust=1523458958&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41377646/1/?bust=1523458958&width=300&-pn.jpg"]},{"ownerid":4,"name":"Lily & Mia","type":"Dog","primarybreed":"Poodle","sex":"F","age":"Adult","description":"NOTE: This is a courtesy posting for another rescuer. Please do not contact ARRF, as we do not know this pet personally. See contact information below.\n\nMia is six and Lily is four. Mia looks more Maltese and Lily appears to have more Poodle in her. They are a bonded pair who must be adopted together. They were among the 44 dogs confiscated from a puppy mill in Southeast San Diego. They were in a windowless enclosure with no room to move around. They had ear mites and were covered with mange. We treated them and got them spayed.Their personalities are coming out as they become more secure in their foster home. Mia and Lily are very sweet girls but you have to start slow with them as they are fearful of new situations. Otherwise they are great with other dogs. They are both crate trained and are telling their foster mom when they need to go outside to go potty but they will need additional work with potty training.\n\nWe suggest a home with children over the age of 10 for this dog. This dog cannot be adopted out of state. Please see our home page for a list of our Saturday adoption sites. Every potential adopter is required to fill out an adoption application and the dog is placed in the home that would be most suitable for the dog. We do not place our dogs in homes with unfenced swimming pools. Generally we don't release the dogs at the adoption site that day except on occasion to former adopters. If you are interested in adopting this pair, please email FCIAdoptions@aol.com or call 619-466-9137.","contact":{"phone":"","state":"CA","address1":"","address2":"","email":"FICAadoptions@aol.com","city":"Vista","zip":"92082","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/34355089/1/?bust=1454105563&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/34355089/1/?bust=1454105563&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/34355089/2/?bust=1454105564&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/34355089/2/?bust=1454105564&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/34355089/3/?bust=1454105564&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/34355089/3/?bust=1454105564&width=300&-pn.jpg"]},{"ownerid":2,"name":"COLT","type":"Dog","primarybreed":"Chihuahua","sex":"M","age":"Young","contact":{"phone":"239-252-7387","state":"FL","address1":"7610 Davis Blvd","address2":"","email":"","city":"Naples","zip":"34104","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41377280/1/?bust=1523433829&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41377280/1/?bust=1523433829&width=300&-pn.jpg"]},{"ownerid":2,"name":"Bonnie","type":"Dog","primarybreed":"Terrier","sex":"F","age":"Adult","description":"WEIGHT 69.4LBS NO CHIP MP","contact":{"phone":"(304) 425-2880","state":"WV","address1":"961 Shelter Rd","address2":"","email":"mcas@frontiernet.net","city":"Princeton","zip":"24740","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/40932369/1/?bust=1523405625&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40932369/1/?bust=1523405625&width=300&-pn.jpg"]},{"ownerid":3,"name":"Azul","type":"Cat","primarybreed":"Domestic Long Hair","sex":"M","age":"Adult","description":"Hello, I'm Azul! I'm a sweet boy with a lot of love to give! I may be a little shy at first, but I'm very affectionate and will purr and roll over while you pet me! I love my sister Ruby so much that we need to go home together for double the fun and double the love! Come see me and my adoptable friends at AAWL's Sonia Breslow Adoption center! 25 North 40th Street Phoenix, AZ 85034 Questions about me? Contact our shelter at 602-273-6852 ext. 103. ","contact":{"phone":"602-273-6852","state":"AZ","address1":"25 N. 40th Street","address2":"","email":"adoptions1@aawl.org","city":"Phoenix","zip":"85034","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41226205/1/?bust=1522389282&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41226205/1/?bust=1522389282&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41226205/2/?bust=1522389287&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41226205/2/?bust=1522389287&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41226205/3/?bust=1522389291&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41226205/3/?bust=1522389291&width=300&-pn.jpg"]},{"ownerid":1,"name":"Fabio","type":"Dog","primarybreed":"Hound","sex":"M","age":"Adult","description":"Fabio gives true love and really wants a family to love him back!  He is a young adult, neutered and fully vetted.  Fabio is a fun active dog and would do well to hike or jog with along with you or just have a fenced yard and plenty of play time.   He knows basic commands and is eager to please when a treat is his reward.  The hound in him thinks it would be fun to chase cats so he would do best without a cat in his life.  Fabio most enjoys spending time with his people.    Fabio is so friendly and happy to meet new people that when we rescued him from death row he had \"happy tail\"; as we call it.  He wagged is tail so hard in his kennel that the tail became damaged from banging on the kennel walls.  It required a partial amputation.  The surgery left him a cute quarter length tail so he still has plenty of tail to wag when he someday meets his forever family.  He is dreaming of that day!\n\nFabio is spending time at our sanctuary playing with other dogs in play yards and snoozin' out in the sun. Interested in meeting Fabio? Please email ayendes.care@gmail.com for more information. \n\nAll C.A.R.E rescue dogs are fully vaccinated, heartworm tested, spayed/neutered, worm/flea free, and dogs are microchipped! So all you need to provide is the love.\n\nFill out an adoption application here: http://www.carerescue.org/caredogapplication\n\nOur adoption fee is a minimum $100 tax deductible donation. All donations are used for rescue and medical care of animals in need. If you don't have room to take home a pet but want to support our efforts to save animals in need, please consider making a donation. We are not city or state funded and rely solely on private donations that allow us to continue saving lives.\n\nTo learn more about us or to give a life saving donation please visit http://www.carerescue.org","contact":{"phone":"","state":"MO","address1":"1328 W. Sunshine Street","address2":"","email":"carerescue@yahoo.com","city":"Springfield","zip":"65807","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/36778681/1/?bust=1479577825&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/36778681/1/?bust=1479577825&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/36778681/2/?bust=1481132228&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/36778681/2/?bust=1481132228&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/36778681/3/?bust=1499534016&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/36778681/3/?bust=1499534016&width=300&-pn.jpg"]},{"ownerid":4,"name":"Nicholas","type":"Dog","primarybreed":"Collie","sex":"M","age":"Young","description":"Nicholas is a 8 mo old collie/hound mix who has the sweetest personality. Nicholas seems to love everything and everyone, crate trained, and working on house training. Nicholas has been neglected in the past and only weighs 20 lbs but he doesnât hold that against you, nothing but kisses when he greets you. Apply today at adoptastray.com.\n\nAll SAAP animals are vet checked, UTD on vaccines, spayed/neutered, micro chipped, and given flea and heartworm preventative as age appropriate.\n\nOur website is: http://www.adoptastray.com/\n\nTo check if this animal is still available visit our master pet list on our website at:\nhttp://www.adoptastray.com/adoptable-animals/\n\nHave questions:\nPlease email us at saap@adoptastray.com for more information about this animal or to answer any questions you may have. You may also contact us at (859)391-1234.\n\nCompleting the online application when you find an animal you are interested in speeds up the adoption process. We can hold your application on file for a period of time if you are still looking for that perfect new family member.\n\nTHE APPLICATION IS AVAILABLE AT THIS LINK:\nhttp://www.adoptastray.com/dog-adoption-application/\n\nINTERESTED IN FOSTERING:\nWe welcome your interest and ask that you complete our on-line foster application:\nhttp://www.adoptastray.com/foster-application/\n4/15/18 6:21 PM","contact":{"phone":"859-391-1234","state":"KY","address1":"P.O. Box 72040","address2":"","email":"SAAP@adoptastray.com","city":"Newport","zip":"41072","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41390484/1/?bust=1523766460&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41390484/1/?bust=1523766460&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41390484/2/?bust=1523766462&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41390484/2/?bust=1523766462&width=300&-pn.jpg"]},{"ownerid":2,"name":"Taffy","type":"Dog","primarybreed":"Boxer","sex":"F","age":"Baby","description":"Hi, my name is Taffy! My sister, Tizzy, and I were abandoned in a field on a rural, country road.  How rude is that?  Luckily for us a nice lady found us and hooked us up with CPR so we could find our forever homes.  My favorite game is hide & seek.  I also enjoy a good game of keep away with my toys!  I look forward to checking out the dog park and other exciting activities as I get older.  I canât wait to try my first hike or go camping!  I promise to give you many years of unconditional love & companionship!  Apply to adopt me today at www.cprdogs.com!\n\nThis puppy is spayed/neutered, up to date on age appropriate vaccinations and current on flea/tick and heartworm preventative.  \n\nThe adoption fee is $450 if your adoption is prepaid prior to your pup's arrival. An additional $50 will be charged on puppies that are picked up from our Southbury CT adoption center, adopted at an event or foster home. This additional fee is necessary in order to comply with CT HB 5368.\nIf you are a MA resident, your new family member is required to go through a mandatory 48 hour quarantine period at the Woburn MA isolation facility. Your new family member will be dropped off by our transport on Thursday and will be ready for you to pick him/her up on Saturday between noon and 2pm. An additional $100 fee will be added for any dogs picked up from the Woburn MA quarantine facility. This additional fee is necessary in order to comply with MA Order 405-CD-12 and Order 1-AHO-05.  \n\nTO APPLY PLEASE GO TO www.cprdogs.com. If your application was successfully submitted you will get a confirmation.\n\nAfter receipt of your application an adoption counselor will then be in touch to answer your questions about this pup, discuss the adoption process and get the ball rolling! If you have not heard from one of our volunteers within 5 days of submitting your application, please email mollibo@gmail.com.","contact":{"phone":"","state":"CT","address1":"","address2":"","email":"mollibo@gmail.com","city":"Watertown","zip":"06795","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41252136/1/?bust=1521917492&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41252136/1/?bust=1521917492&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41252136/2/?bust=1521917496&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41252136/2/?bust=1521917496&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41252136/3/?bust=1521917498&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41252136/3/?bust=1521917498&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41252136/4/?bust=1521917503&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41252136/4/?bust=1521917503&width=300&-pn.jpg"]},{"ownerid":3,"name":"Donathan","type":"Cat","primarybreed":"Persian","sex":"M","age":"Young","description":"Meet Donathan!  He is Brevardâs very own âgrumpy catâ.  Though he has a sour look on his face, he is actually quite friendly and personable.  He is a one year old male cat who has always lived indoors, and is used to being spoiled.  His owner can no longer take care of him.   Maybe becoming a member of your family would put a smile on Donathanâs face again!\n\n","contact":{"phone":"828 883-3713","state":"NC","address1":"1124 Old Rosman Hwy","address2":"","email":"malmin@citcom.net","city":"Brevard","zip":"28712","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41193859/1/?bust=1521216499&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41193859/1/?bust=1521216499&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41193859/2/?bust=1521216519&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41193859/2/?bust=1521216519&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41193859/3/?bust=1521216535&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41193859/3/?bust=1521216535&width=300&-pn.jpg"]},{"ownerid":5,"name":"STAR","type":"Dog","primarybreed":"Labrador Retriever","sex":"F","age":"Young","contact":{"phone":"404-613-0358  ","state":"GA","address1":"860 Marietta Blvd. NW","address2":"","email":"AC.Info@fultoncountyga.gov","city":"Atlanta","zip":"30318","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/40618821/1/?bust=1515509647&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40618821/1/?bust=1515509647&width=300&-pn.jpg"]},{"ownerid":3,"name":"brandon","type":"Dog","primarybreed":"Mastiff","sex":"M","age":"Adult","description":"18 mo old.  good with older kids-he can knock small kids down in his playfullness.  loves people.  call 435 828-2299 or email timdar@ubtanet.com for more info","contact":{"phone":"See phone number in bio    ","state":"UT","address1":"","address2":"","email":"petsamaritan@gmail.com","city":"Salt Lake City","zip":"84109","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41207790/1/?bust=1521394905&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41207790/1/?bust=1521394905&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41207790/2/?bust=1521394912&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41207790/2/?bust=1521394912&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41207790/3/?bust=1521394912&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41207790/3/?bust=1521394912&width=300&-pn.jpg"]},{"ownerid":1,"name":"TAZ","type":"Dog","primarybreed":"Australian Cattle Dog / Blue Heeler","sex":"M","age":"Baby","description":"Taz is a Australian Cattle/Beagle Cross, Born on Sep 18, 2017, male, house trained, when mature he will be around 45 lbs., very sweet and submissive, great along well with kids, dogs, not tested with cats.\n\nIf you are interested in adopting one of them, please fill out the Adoption application at... http://hiarc.ca/webver2/adopt/","contact":{"phone":"204-688-6555","state":"MB","address1":"","address2":"","email":"info@hiarc.ca","city":"Oakbank","zip":"R0E 1J1","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41293846/1/?bust=1522426310&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41293846/1/?bust=1522426310&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41293846/2/?bust=1522426321&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41293846/2/?bust=1522426321&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41293846/3/?bust=1522426332&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41293846/3/?bust=1522426332&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41293846/4/?bust=1522426343&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41293846/4/?bust=1522426343&width=300&-pn.jpg"]},{"ownerid":5,"name":"Roxy","type":"Dog","primarybreed":"Cattle Dog","sex":"F","age":"Senior","description":"This listing is a courtesy post.  Houston Chow Chow Connection can not confirm any of the details provided.  \n\nRoxy is a 9 y/o Chow/ACD located in Springfield, KY. She was an owner surrender after her owner could no longer care for her, but she's one of the best dogs. She lived as a house dog for 8 years, so she's house-trained and very well-behaved. She was raised with kids. She seems indifferent to cats. She was somewhat nervous about other dogs initially but is getting much better. Most people have been turned off by her age, but she definitely doesn't act like a senior. She's kinda sassy! She'd fit in really well as a family dog!  Could you be that perfect home?\n\nIf you would like further information or to meet Roxy, please contact Ariella Gibson acgibson17@gmail.com.","contact":{"phone":"","state":"TX","address1":"448 West 15th Street","address2":"Box 553","email":"chowmail.hccc@gmail.com","city":"Houston","zip":"77008","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/38165108/1/?bust=1495817142&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38165108/1/?bust=1495817142&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38165108/2/?bust=1495817142&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38165108/2/?bust=1495817142&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38165108/3/?bust=1495817143&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38165108/3/?bust=1495817143&width=300&-pn.jpg"]},{"ownerid":4,"name":"Harry","type":"Dog","primarybreed":"Australian Shepherd","sex":"M","age":"Baby","description":"I am 6 weeks old, love other dogs & all people!\n\nMy siblings are Hermione, Ron, and Ginny!\n\nI will be available for adoption on April 28th. I cannot have any visitors beforeÂ April 28th. You will need to fill out an online application and receive a phone call back from a staff member that everything is ok with the application prior toÂ April 28th. All family members and any dogs from the household need to be present at the time of the adoption.\n\nAdoption donation: $450\n\nWe open at 9 am Saturday mornings and we will be helping adoptions in the order of when they submitted an approved application to us. There will be a sign in sheet on the front door at 8:30 am so that we can pull applications for the people that arrive between 8:30-9am. Again, the order in which adoptions will come in to the shelter to see any adoptable dogs or cats first thing on Saturday mornings will be as to when the application was submitted to Animal House Shelter so there is no need to come to the shelter any earlier than 8:30 to sign in. This will be the procedure for people that arrive between 8:30-9am.\n\nAfter 9am, on Saturday mornings it will be first come, first serve after we help all of the adoptions that signed in between 8:30-9am. Most people submit general applications to us which do not specify a name or a particular litter they are interested in so there is no way for us to know until people arrive Saturday morning at 8:30 how many people are interested in a particular litter, puppy, kitten, cat or adult dog. We always have around 300 dogs & cats available for adoption and the adoption counselors will help you to find the right companion for your family! We look forward to meeting you!\n\nAll dogs are microchipped, neutered, current on all vaccines, heartworm tested and started on Tri Heart Plus & Vectra 3D.\n\nAdoptable Dogs:  http://www.animalhouseshelter.com/?page_id=343\n\n  The website www.animalhouseshelter.com is always kept 100% up to date with who is currently available and all new animals (40/week) are added to the site 2 weeks before their availability date to give you time to fill out your adoption application and get the family ready to come out to the shelter that day. So keep any eye on the site for any animals being added as available for adoption as new animals are added everyday!\nI would recommend if you havenât done so already that you submit a general online adoption application with us so it is on file for when you are ready to come out and adopt.  The adoption counselors will be able to show you many  that would be a good fit for your family.  We do go in order of when you submitted your application with us.  So it is always best that you get your general application for any animal in with us as soon as possible.\nHere is the link to the Adoption Application: https://www.animalhouseshelter.com/adoption-application/\n \nThank you!\nAnimal House Shelter\n13005 Ernesti Road\nHuntley IL, 60142\nwww.animalhouseshelter.com\nOpen \nSunday, Monday, Wednesday, Thursday and Friday from 11 AM to 7 PM, \nTuesday from 11 am to 4 pm and \nSaturday's 9 AM to 7 PM. \n847-961-5541\n847-961-5537 fax\n\nConnect With Us:\n\"Like\" Us On Facebook!\nWatch Us On YouTube!\nFollow Us On Twitter! \n\nAdoption Application:  http://www.animalhouseshelter.com/index.php?page_id=287\n\nHow to Adopt: http://www.animalhouseshelter.com/?page_id=31\n\nDirections to Shelter:  http://www.animalhouseshelter.com/?page_id=31\n\nAdoptable Dogs:  http://www.animalhouseshelter.com/?page_id=343","contact":{"phone":"(847) 961-5541","state":"IL","address1":"13005 Ernesti Rd","address2":"","email":"info@animalhouseshelter.com","city":"Huntley","zip":"60142","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41396538/1/?bust=1523632732&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41396538/1/?bust=1523632732&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41396538/2/?bust=1523632734&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41396538/2/?bust=1523632734&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41396538/3/?bust=1523632736&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41396538/3/?bust=1523632736&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41396538/4/?bust=1523632738&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41396538/4/?bust=1523632738&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41396538/5/?bust=1523632739&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41396538/5/?bust=1523632739&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41396538/6/?bust=1523632741&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41396538/6/?bust=1523632741&width=300&-pn.jpg"]},{"ownerid":5,"name":"Max","type":"Cat","primarybreed":"Domestic Short Hair","sex":"M","age":"Adult","description":"Max is a very sweet neutered male and he has a microchip. He has been here for almost two months and has now gotten accustomed to hearing barking dogs and doesn't have as much fear of them as he used to. He doesn't mind other cats being around and he is very affectionate and loves to purr. If you are looking for the perfect laid back loving cat, look no further, Max is your man. If you are interested in adopting Max please give us a call at 252-444-2712 or stop by and see us. We are open 7 days a week from 8am to 5pm.","contact":{"phone":"(252) 444-2712","state":"NC","address1":"6 Governmental Ave","address2":"","email":"csmith@havelocknc.us","city":"Havelock","zip":"28532","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/39845172/1/?bust=1510019979&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39845172/1/?bust=1510019979&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39845172/2/?bust=1510019992&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39845172/2/?bust=1510019992&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39845172/3/?bust=1514751647&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39845172/3/?bust=1514751647&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39845172/4/?bust=1514751647&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39845172/4/?bust=1514751647&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39845172/5/?bust=1514751648&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39845172/5/?bust=1514751648&width=300&-pn.jpg"]},{"ownerid":1,"name":"ROBERT","type":"Dog","primarybreed":"Doberman Pinscher","sex":"M","age":"Adult","description":"A pre adoption application must be completed for any pets you are interested in adopting. Pre adoption applications can be found at www.florencehumanesociety.org or at our shelter. Fax applications to 843-629-5457 or email wwilton@cityofflorence.com \nAll cats are $65 and all dogs are $85.","contact":{"phone":"843-629-5456  ","state":"SC","address1":"1434 McCurdy Rd","address2":"","email":"wwilton@cityofflorence.com","city":"Florence","zip":"29503","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41130118/1/?bust=1523820434&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41130118/1/?bust=1523820434&width=300&-pn.jpg"]},{"ownerid":4,"name":"Patrick","type":"Dog","primarybreed":"English Bulldog","sex":"M","age":"Baby","description":"Patrick is about 6 month old and was rescued from a kill shelter along with her brother on their last day. He is very playful and super sweet. He is crate trained and working on basic obedience. Patrick is deaf but thatâs doesnât slow him down at all.He will need a patient home with the time and patient to work on more obedience.","contact":{"phone":"(850) 368-7632","state":"FL","address1":"","address2":"","email":"lnrrescue@gmail.com","city":"Navarre","zip":"32566","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/39788089/1/?bust=1509411794&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39788089/1/?bust=1509411794&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39788089/2/?bust=1509411799&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39788089/2/?bust=1509411799&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39788089/3/?bust=1515704459&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39788089/3/?bust=1515704459&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39788089/4/?bust=1515704460&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39788089/4/?bust=1515704460&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39788089/5/?bust=1509411805&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39788089/5/?bust=1509411805&width=300&-pn.jpg"]},{"ownerid":5,"name":"Abby & Lilly - URGENT","type":"Dog","primarybreed":"Great Pyrenees","sex":"F","age":"Senior","description":"Meet Abby & Lilly,\n\nThese sweet siblings were adopted to the same furever home when they were puppies.  Abby and Lilly had a wonderful home for years until their owner passed away unexpectely.  Lucky for them, their ownerâs elderly father moved into their home to take care of them.  Now years laters their owner is in Hospice care so now Abby and Lily need a new furever home.\n\nAbby and Lilly are friendly pup about 10 years old.  They are docile, easy going and layed back.  They love nothing more than playing in the yard, going for walks and hanging out with you.\n\nThere is a lot to be said about an older dog, they have outgrown the urge to chew on things, they are not as rowdy as puppies and they appreciate just hanging out and keeping you company.\n\nAbby and Lilly would make wonderful loyal, low energy walking buddies for a nice family.  We are sure when you meet them, you will fall in love!\np>Â \nTHE BREED THIS PET IS LISTED AS IS OUR BEST GUESS AS WE HAVE NO BACKGROUND INFO ON WHO THE MOM OR DAD ARE. We do not have a shelter facility you can visit.  Our volunteers foster the dogs and pups in their private homes once they have been vetted and transported here. Please read our homepage to see how the adoption process works. If interested in adopting this pet, please e-mail FureverHomeDogRescue@gmail.com and request an adoption application. Please note we do not adopt puppies/dogs to homes where they will be alone all day. ","contact":{"phone":"","state":"NJ","address1":"","address2":"","email":"Gone2TheDawgz@yahoo.com","city":"Somerset","zip":"08873","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41293802/1/?bust=1522424901&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41293802/1/?bust=1522424901&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41293802/2/?bust=1522424907&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41293802/2/?bust=1522424907&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41293802/3/?bust=1522424910&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41293802/3/?bust=1522424910&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41293802/4/?bust=1522424916&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41293802/4/?bust=1522424916&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41293802/5/?bust=1522424921&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41293802/5/?bust=1522424921&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41293802/6/?bust=1522424930&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41293802/6/?bust=1522424930&width=300&-pn.jpg"]},{"ownerid":3,"name":"PANDA","type":"Dog","primarybreed":"Border Collie","sex":"F","age":"Adult","contact":{"phone":"210-207-6666 ","state":"TX","address1":"4710 State Hwy 151","address2":"","email":"ACSAdoptions@sanantonio.gov","city":"San Antonio","zip":"78227","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41353921/1/?bust=1523169601&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41353921/1/?bust=1523169601&width=300&-pn.jpg"]},{"ownerid":4,"name":"Coso","type":"Dog","primarybreed":"Pointer","sex":"M","age":"Young","description":"Handsome Coso is probably a Pointer - Coonhound mix. He is friendly, good with other dogs and crate trained.\n\nKellen Rescue typically require fenced yards and usually do not adopt out of State. Our dogs are in foster homes and available to meet by appointment.","contact":{"phone":"209 742-4294","state":"CA","address1":"PO Box 3496","address2":"","email":"kellen@sti.net","city":"Oakhurst","zip":"93644","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/27816367/1/?bust=1384087843&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/27816367/1/?bust=1384087843&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/27816367/2/?bust=1423413566&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/27816367/2/?bust=1423413566&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/27816367/3/?bust=1439732931&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/27816367/3/?bust=1439732931&width=300&-pn.jpg"]},{"ownerid":1,"name":"DUKE - A gentle giant","type":"Dog","primarybreed":"Boxer","sex":"M","age":"Young","description":"Go to www.\nARKsaves.com to read the complete animal bio\n\nEMOTIONAL SUPPORT ANIMAL8 FREE GROUP DOG TRAINING SESSIONS WITH OUR DOG WHISPERER/TRAINER in Orange City FL\nVisit Jose working with ARK dogs: https://youtu.be/cVj2W2X0z9w; Jose's group lesson video: https://youtu.be/Sr844IQmGls\nAdopt fee includes sterilization, heartworm test, microchip, shots, dewormimg.\nADOPT FEE - FULLY VETTED: $ 55\nMy Story: My dad just died and you can imagine how I feel. We were tied to each other and did everything together. I'm with a kind man now and his beautiful little girl. Please look at the photo of me with her and her little dog - it proves how very gentle I am.\nI'm 5 and weight about 65 pounds, am well mannered, healthy, and truly enjoy being a couch potato.\nMy Location: Contact Diane Sykes at diane_sykes@live.com to arrange a meeting with me. I'm in the Crescent City area.\n\nBark, Bark - Come and get me please!\nEmotional Support Animals (ESA)\nEmotional Support Animals are not required to undergo specialized training. They can be dogs, cats, exotics, birds. Their primary role is to provide their owners with emotional comfort. Emotional support animals can benefit a disabled individual psychologically. The basic gift of companionship and unconditional affection can be the therapy needed to counter a condition like debilitating depression or Post Traumatic Stress Disorder.\nESAs are protected under the Fair Housing Amendments Act (FHAA) and the Air Carrier Access Act (ACAA). People meeting the proper criteria are entitled to an ESA to assist them with life. The FHAA protects individuals by allowing ESAs to live with them regardless of breed (even with no pet policies). The ACAA protects individuals by allowing ESAs to fly with them in the cabin of an airplane without having to pay additional fees. ESAs are not required to be professionally trained. An owner can train the pet. A letter of need written by a mental health counselor may be required for those wanting to transport via plane or for landlords. For information regarding the legalities of ESA contact maggihall14@gmail.com.\n\nIf you can't find what you want at ARK go to the following and TRULY save a life. They still kill though trying to go NO KILL. Help them achieve that goal!\n\nSo\n\nutheast Volusia Humane Society\n\n- 1200 S Glencoe Rd (mile east of I-95), New Smyrna; 386.428.9860; sevhumanesociety@gmail.com;\n\nMonâSat 10- 5; Sun 10-2\n\nHalifax Humane Society - 2364 LPGA @ I-4, Daytona; 386.274.4703; www.halifaxhumanesociety.org;\nMonâSat 10â6; Sun 10-2\n\nPutnam County Animal Control\nâ 523 Reid St, Palatka; 386.329.0396;\nputpets.com\n(donât put www); MonâThur 10â4; Fri 10â12; Sat 9-3\n\n1/31/18 8:12 AM","contact":{"phone":"(386) 624-3661","state":"FL","address1":"1952 S US Hwy 17","address2":"Crescent City Kennel","email":"arksaves@gmail.com","city":"Crescent City","zip":"32112","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/40687396/1/?bust=1516144401&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40687396/1/?bust=1516144401&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40687396/2/?bust=1516144401&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40687396/2/?bust=1516144401&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40687396/3/?bust=1517436125&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40687396/3/?bust=1517436125&width=300&-pn.jpg"]},{"ownerid":2,"name":"Scout","type":"Dog","primarybreed":"German Shepherd Dog","sex":"M","age":"Adult","description":"Say hello to Scout! Scout is a fun loving guy who is looking for a friend to explore with! Scout would love to be in an active home where he has a buddy to run with or a fenced in yard to play in. This smart boy knows lots of tricks and loves learning new ones! Scout is unsure about meeting new people but once you are his friend you have a friend for life! He has made many dog friends and loves playing outside with them, he might even enjoy having a canine sibling in his new home! Scout is looking for a confident owner who will show him the ropes. More than anything he is hoping to find a home that will give him all the love and attention he deserves. Call to meet Scout today!Our Adoption Hotline, 847-728-5434 option 2, is open Monday-Friday, 10am-5pm and we are happy to assist you with any questions!To apply to adopt a pet from Wright-Way Rescue, please fill out an online application at www.wright-wayrescue.org. Once approved, you may place a reservation to meet the pet you see above. Please place a reservation only if you are seriously considering adding this pet to your home.Wright-Way Rescue has two locations, the North Shore Humane Center and the Admission and Medical Services Campus. Please pay close attention to the location of the pet, which is listed above. All pets travel to the North Shore Humane Center in Morton Grove once they are ready for adoption. Please call the Adoption Hotline to find out more about a pet's location and availability date. Animals can also be adopted from our Admission and Medical Services Campus in Murphysboro, IL. Reservations for the Murphysboro location can be made by calling 618-208-1509.If you would like to look more casually at our adoptable animals, please stop by Wright-Way Rescue's North Shore Humane Center located at 5915 Lincoln Avenue in Morton Grove, IL. Our hours of operation are Thursday 2pm-8pm, Friday 12pm-8pm, and Saturday/Sunday 11am-4pm. We are closed Monday-Wednesday.All Wright-Way Rescue animals come up-to-date on medical care. The adoption fee includes: current vaccinations including Canine Influenza, initial deworming medication, microchip and registration, a veterinary check with health certificate, and a 30 day free trial of pet health insurance.Thank you for considering adoption from Wright-Way Rescue! We are a 501(c)(3) non profit, no-kill organization. Wright-Way Rescue places more dogs in adoptive homes than any other rescue in the State of Illinois on just 10% of the budget. We look forwarding to assisting your call on our Adoption Hotline, 847-728-5434,option 2. 4/13/18 5:31 PM","contact":{"phone":"847-728-5434","state":"IL","address1":"5915 Lincoln Avenue","address2":"","email":"wrightwayadopt@gmail.com","city":"Morton Grove","zip":"60053","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41209243/1/?bust=1521440308&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41209243/1/?bust=1521440308&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41209243/2/?bust=1521440426&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41209243/2/?bust=1521440426&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41209243/3/?bust=1521440510&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41209243/3/?bust=1521440510&width=300&-pn.jpg"]},{"ownerid":4,"name":"Fancy","type":"Dog","primarybreed":"Beagle","sex":"F","age":"Adult","contact":{"phone":"601-798-8000","state":"MS","address1":"1700 Palestine Road","address2":"","email":"prcspca@prcspca.org","city":"Picayune","zip":"39466","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41334592/1/?bust=1523018256&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41334592/1/?bust=1523018256&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41334592/2/?bust=1523018260&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41334592/2/?bust=1523018260&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41334592/3/?bust=1523018262&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41334592/3/?bust=1523018262&width=300&-pn.jpg"]},{"ownerid":2,"name":"Gracie","type":"Dog","primarybreed":"Greyhound","sex":"F","age":"Adult","description":"Gracie makes us smile all the time. She is a super sweet, happy, loving girl and she is just beautiful to watch at play or curled up at rest. This sweet girl is just dying for affection and a family to love. Gracie loves giving kisses, playing chase with you and just knowing that you are there for her. Left behind when her beloved family moved away and could not to take her, Gracie hopes to find that true forever home this time. She is such a good girl, she is house trained, crate trained and would make a great addition to almost any home so call us today to meet her.","contact":{"phone":"(830) 981-2300","state":"TX","address1":"28730 IH-10 West- Exit 546","address2":"Fair Oaks Ranch","email":"hotk9rescue@yahoo.com","city":"San Antonio","zip":"78260","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/26416835/1/?bust=1371421591&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/26416835/1/?bust=1371421591&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/26416835/2/?bust=1431538463&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/26416835/2/?bust=1431538463&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/26416835/3/?bust=1390506585&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/26416835/3/?bust=1390506585&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/26416835/4/?bust=1498331303&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/26416835/4/?bust=1498331303&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/26416835/5/?bust=1498331303&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/26416835/5/?bust=1498331303&width=300&-pn.jpg"]},{"ownerid":1,"name":"Jamboree","type":"Dog","primarybreed":"Border Collie","sex":"M","age":"Young","description":"What a pleasure to meet you!  I love meeting new people, new dogs, and new cats!  May I introduce myself?  My name is Jamboree and I'm four years old.  I'm not sure you can tell from my photos and you might be too polite to ask but I'm on the smaller side of average for a genteel Lab mix.  More about me?  My early days are a mystery that left me very occasionally skittish but the vast majority of my time is spent enjoying life.  I'm so good with other dogs.  I enjoy playing and hanging out and generally forging good relationships with all sorts of other dogs.  I'd love to have a canine friend in my new home.  Cats?  I am very good with kitties and I treat them with the utmost respect.  Besides playing with other dogs, admiring cats, and getting attention from people, my great pleasures include riding in the car and going on walks.  As you might imagine, I am an excellent companion in the car and do not display any of those shenanigans you sometimes see in unruly adolescents.  No, I am a lady and I conduct myself accordingly, both in the car and in the house.  I'm sure you realize you don't need to ask but I will confirm for you that I'm completely house trained and I use the doggie door like a pro.  No problem barking from me.  I am crate trained and enjoy napping in my crate but I am completely dependable in the house, too.  I can't remember the last time the door to my crate was closed.  If you are a dog lover who understands that sometimes a girl's past means she finds herself unsure once in a while, we should make a date to get together.  I can't wait to meet you!\n\n\nWe require an application, phone interview and home visit prior to adoption. We will not discuss a specific dog with an applicant until the adoption process is completed. Our adoption fee for dogs under 8 months is $300, dogs between 9 months and 7 years is $250 and our super seniors are $125. Please visit our website for more information. Thank you!","contact":{"phone":"3036714659    ","state":"CO","address1":"PO Box 416","address2":"","email":"rrocbox@gmail.com","city":"Evergreen","zip":"80437","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/29870299/1/?bust=1483202189&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/29870299/1/?bust=1483202189&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/29870299/2/?bust=1483202190&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/29870299/2/?bust=1483202190&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/29870299/3/?bust=1483202190&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/29870299/3/?bust=1483202190&width=300&-pn.jpg"]},{"ownerid":1,"name":"Korra","type":"Dog","primarybreed":"Boxer","sex":"F","age":"Adult","description":"Korra is a 22 month old, 60 lb Boxer/Belgian Malinois mix who came to Ruff Life after she was being sold on a yard sale site.  Korra was adopted and returned 1 1/2 years later due to her adopter's health. Korra has a great disposition! She is good with other dogs and is boarding in doggy daycare where she loves to run around playing. Korra is great in her crate and house trained.   \n\nKorra is not much of a cuddler and her only downfall is that she does not like restraint so she needs to be sedated for any handling at the vet.  We, along with her vet, strongly believe this is something she can work past and that her prior vet may have been to forceful with her causing these issues as she did not have them when we originally had her in the rescue as a puppy.  Because of her size (she's tall) and love to run, we do not recommend apartment living for Korra and due to the restraint issues, we do not recommend young children who will want to hug or hold onto Korra.\n\nOur adoption fee is $250. All dogs are spayed/neutered, microchipped, dewormed, fecal tested and up to date on flea/tick and heartworm prevention. Puppies are up to date on age appropriate shots. Adults are also up to date on vaccines and heart worm tested (and treated if positive).\n\nFor more information on meeting and/or adopting Korra, please visit www.ruffliferescue.com","contact":{"phone":"","state":"SC","address1":"","address2":"","email":"info@ruffliferescue.com","city":"Fort Mill","zip":"29707","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/35893397/1/?bust=1470866566&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/35893397/1/?bust=1470866566&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/35893397/2/?bust=1473735727&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/35893397/2/?bust=1473735727&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/35893397/3/?bust=1473735728&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/35893397/3/?bust=1473735728&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/35893397/4/?bust=1523152368&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/35893397/4/?bust=1523152368&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/35893397/5/?bust=1523152369&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/35893397/5/?bust=1523152369&width=300&-pn.jpg"]},{"ownerid":3,"name":"Henry","type":"Dog","primarybreed":"Cocker Spaniel","sex":"M","age":"Senior","description":"Henry was walked into Taps as a stray and we don't have much history of where he has been, but I can tell you that he is looking for a loving, caring home that will help him enjoy the rest of his years to come. Henry came in a little rough after living the hard knocks life but he is being closely watched and healing nicely. He had some ouchie ears upon arrival and is very skinny. He is slowly but surely putting on a little weight and starting to wag his tail again. ","contact":{"phone":"(309) 353-8277","state":"IL","address1":"100 TAPS Lane","address2":"","email":"tapsinfo@yahoo.com","city":"Pekin","zip":"61554","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/40536516/1/?bust=1514541722&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40536516/1/?bust=1514541722&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40536516/2/?bust=1514541726&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40536516/2/?bust=1514541726&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40536516/3/?bust=1514541730&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40536516/3/?bust=1514541730&width=300&-pn.jpg"]},{"ownerid":1,"name":"Fluffy","type":"Cat","primarybreed":"Domestic Long Hair","sex":"M","age":"Adult","description":"Name: Fluffy\n\nDOB: May 2015\n\nGender: Male\n\nDescription: Brown and White Tabby Long Haired \n\nFLUFFY is a truly amazing kitty who has been through so much in his short life. He is a sweet boy who is both bold and timid. \n\nOnce Fluffy feels secure in his surroundings, he races around with confidence. He bats toy mice around and even chases his own tail! Fluffy also LOVES spending time on a screened-in porch. Fluffy is bold when it comes to other cats - he runs right up to them to touch noses.\n\nFluffy is bonded with his foster mom, but a little timid toward other people. His foster mom can pick him up and carry him around like a rag doll. He likes to be petted and brushed when he's in the mood, but he can also be a little nippy when he gets over stimulated, or is not in the mood for being handled. \n\nFluffy needs a quiet home with a patient caretaker whose home is not expected to change much over time. He also needs a playful cat who likes to be chased when playing and who won't be intimidated by Fluffy's lack of 'kitty etiquette.' Fluffy wants to play with other cats, but isn't sure how to play. \n\nFluffy clearly had a home at some point. Having lived outdoors for at least a year, we can only imagine what he lived through. Because his right front leg had severely torn tendons, his leg had to be amputated. Most cats do great on three legs - they just need a little time to get their bearings and not feel vulnerable. Fluffy is no exception - he races around, runs up and down carpeted stairs, and jumps up and down couches and beds with ease. He also has no problem jumping in and out of his high-sided litter box and buries his waste with gusto. \n\nFluffy managed to survive outdoors hobbling around on three legs. A kind woman spent months feeding him and gaining his trust. Once she discovered that Fluffy was a sweet, social cat, she reached out for help. If you have a big heart AND the right home environment (quiet with a friendly cat and hopefully a screened-in porch!), please consider adopting Fluffy. He will reward you with lots of purring and love.\n\nPlease be sure to visit our website (http://www.spcanova.org/adoption/catlist.php) for details about our adoption policies.","contact":{"phone":"703-799-9390","state":"VA","address1":"P.O. Box 100220","address2":"","email":"spcanova@aol.com","city":"Arlington","zip":"22210","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/38333702/1/?bust=1509131037&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38333702/1/?bust=1509131037&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38333702/2/?bust=1509131037&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38333702/2/?bust=1509131037&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38333702/3/?bust=1509131038&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38333702/3/?bust=1509131038&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38333702/4/?bust=1509131038&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38333702/4/?bust=1509131038&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38333702/5/?bust=1520974614&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38333702/5/?bust=1520974614&width=300&-pn.jpg"]},{"ownerid":3,"name":"Braveheart","type":"Dog","primarybreed":"Pit Bull Terrier","sex":"M","age":"Adult","description":"Braveheart was spotted by our field volunteers in the 5th Ward, with a huge tumor - the size of a football - hanging off of a front leg while he was tethered in a backyard. We reached out to his owners, offering to get him treatment,  and he was surrendered to our care. Braveheart was taken to the vet immediately where it was learned that the growth was an out of control abscess. His foster mom kept him comfortable while he gained some weight, then the growth was removed and found to be non-cancerous!\n\nNow Braveheart is a very healthy, happy boy who is ready for his forever home. He's 3-4 years old and weighs approximately 50-55lbs. He loves to play with other dogs and is a really fun dog. He aims to please and is a happy-go-lucky kind of fella! Does this sound like the kind of companion you are looking for? If so, Braveheart is waiting to be your dog!\n\nFor more information, or to adopt Braveheart, please fill out an adoption application on our website at forgottendogs.com/adopt/application/ and mention Braveheart. - Thanks!!","contact":{"phone":"","state":"TX","address1":"PO Box 506, Porter, TX 77365","address2":"","email":"info.5thward@gmail.com","city":"Porter","zip":"77365","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/35397576/1/?bust=1466042376&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/35397576/1/?bust=1466042376&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/35397576/2/?bust=1466042376&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/35397576/2/?bust=1466042376&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/35397576/3/?bust=1466042377&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/35397576/3/?bust=1466042377&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/35397576/4/?bust=1515387378&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/35397576/4/?bust=1515387378&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/35397576/5/?bust=1515387379&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/35397576/5/?bust=1515387379&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/35397576/6/?bust=1515387379&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/35397576/6/?bust=1515387379&width=300&-pn.jpg"]},{"ownerid":2,"name":"Jigs","type":"Dog","primarybreed":"Husky","sex":"M","age":"Adult","description":"Are you looking for a constant companion to take on hikes or just snuggle with on the couch?  Then look no further than this gorgeous boy.  Jigs is around 2.5 years old tricolor Husky and Australian Shepherd mix, weighing approximately 65 lbs and has one ear that stands up and one that falls over,  which is just adorable.  Did we mention that his coat is unbelievably soft and shiny?  He really is a stunning dog.  Jigs loves to go for car rides, plays fetch, and loves to work on tricks.  Jigs needs to go to an experienced large breed dog home only with no kids or cats,  with a large fenced yard and time to continue his training.  Jigs needs mental & physical activity, continued training, and patience.  He walks well on a leash and is crate trained. Jigs is microchipped, up to date on vaccines including his heartworm preventative, neutered and is being fostered in Huntsville, AL but available in your area.  If you are interested in this eye catching gentleman, please apply for Jigs at www.forrescue.net/dog-application.   Once received, his foster mom will be in touch and can answer all of your questions.","contact":{"phone":"","state":"AL","address1":"","address2":"","email":"info@forrescue.net","city":"Huntsville","zip":"35802","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41004014/1/?bust=1519185787&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41004014/1/?bust=1519185787&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41004014/2/?bust=1519185793&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41004014/2/?bust=1519185793&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41004014/3/?bust=1519185802&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41004014/3/?bust=1519185802&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41004014/4/?bust=1519185804&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41004014/4/?bust=1519185804&width=300&-pn.jpg"]},{"ownerid":1,"name":"Abby","type":"Dog","primarybreed":"Yorkshire Terrier Yorkie","sex":"F","age":"Senior","contact":{"phone":"(435)640-4752","state":"UT","address1":"P. O. Box 70","address2":"","email":"nancy@pflu.org","city":"Heber City","zip":"84032","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41313340/1/?bust=1522720421&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41313340/1/?bust=1522720421&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41313340/2/?bust=1522720424&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41313340/2/?bust=1522720424&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41313340/3/?bust=1522720426&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41313340/3/?bust=1522720426&width=300&-pn.jpg"]},{"ownerid":5,"name":"Calypso","type":"Cat","primarybreed":"Domestic Long Hair","sex":"F","age":"Senior","description":"Calypso is a gorgeous girl and she knows it! She is looking for a new roost to rule and a new family to fuss over her. Caly gets along well with other low key cats, but no feisty kittens, please. She loves human attention as well\nCalypso is UTD on vaccines and has been tested for FLT/FIV. She is spayed and will be microchipped before going to her new forever home.\nShe is a tabitort dsh. Her approximate DOB was 12/11/07 and her date of arrival was 9/16/17.\nPlease fill out an  online application.  or call 231-924-9230 for more information. WE DO NOT DO SAME DAY ADOPTIONS","contact":{"phone":"231-924-9230","state":"MI","address1":"PO Box 475","address2":"7645 West 48th Street","email":"contactus@bellwetherharbor.org","city":"Fremont","zip":"49412","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/39553514/1/?bust=1507069274&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39553514/1/?bust=1507069274&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39553514/2/?bust=1510093261&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39553514/2/?bust=1510093261&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39553514/3/?bust=1510093262&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39553514/3/?bust=1510093262&width=300&-pn.jpg"]},{"ownerid":1,"name":"Lesley","type":"Cat","primarybreed":"Calico","sex":"F","age":"Adult","description":"MY STORY: Lesley was brought to Cedar Bend from a partnering vet clinic that acquired Lesley as a stray. \n\nAGE: Lesley is about 5 years old. \n\nWHAT TYPE OF HOME AM I SEARCHING FOR: Lesley is a lazy girl who can be a bit of a diva. She loves to snooze in comfy beds, she thinks catnip is fantastic, and her personality is one of a kind. She isn't a big fan of being picked up, but she will happily lay around, and probably watch Netflix or the news with you. \n\nAdoption fee: $35 - Adoption fee include spay/neuter, vaccinations, worming, microchip, and a start on flea/tick prevention.","contact":{"phone":"319-232-6887","state":"IA","address1":"1166 W Airline HWY","address2":"","email":"cbhsadoption@mchsi.com","city":"Waterloo","zip":"50703","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41134939/1/?bust=1520565558&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41134939/1/?bust=1520565558&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41134939/2/?bust=1520565588&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41134939/2/?bust=1520565588&width=300&-pn.jpg"]},{"ownerid":4,"name":"Abby","type":"Dog","primarybreed":"Pit Bull Terrier","sex":"F","age":"Adult","description":"For more information please call Open Door Animal Sanctuary at 636-671-3643 between the hours of 10A.M. and 4P.M., seven days a week.\n\n\nHello, my name is Abby. I am a sweet pit mix who adores people. I came to Open Door Animal Sanctuary as a stray, so not much is known about me pre-open door. I do not like other dogs, but I'm amazing with people. I love going to walks, runs, and hikes... anything to keep me moving! Wont you come and meet me?","contact":{"phone":"(636)671-3643","state":"MO","address1":"Mailing Address: P.O. Box 870","address2":"Call for Directions","email":"Dogs@odas.org","city":"House Springs","zip":"63051","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/38145799/1/?bust=1517422097&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38145799/1/?bust=1517422097&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38145799/2/?bust=1495641863&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38145799/2/?bust=1495641863&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38145799/3/?bust=1517422097&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38145799/3/?bust=1517422097&width=300&-pn.jpg"]},{"ownerid":2,"name":"BOBO","type":"Dog","primarybreed":"German Shepherd Dog","sex":"M","age":"Adult","contact":{"phone":"520-724-5900","state":"AZ","address1":"4000 N. Silverbell RD","address2":"","email":"","city":"Tucson","zip":"85745","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/40873785/1/?bust=1521893016&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40873785/1/?bust=1521893016&width=300&-pn.jpg"]},{"ownerid":3,"name":"Aurora","type":"Dog","primarybreed":"German Shepherd Dog","sex":"F","age":"Young","description":"There is very little we know about beautiful Aurora other than she's been stuck at animal control for a couple of months with no way out unless rescue pulls her. We have and we're happy to be getting her. She's coming March 13th via transport. We'll post more  photos and more information once she gets here and acclimated into foster care. She is said to be 6-8months old and very sweet. Aurorawill be spayed, brought current on vaccines and microchipped. She'll go to her forever home with her food/bowls, bed and toys she chooses.\nFor adoption consideration of this sweet girl, please contact causeforpawsrescue@gmail.com\nApplications can also be downloaded via our webpage at causeforpaws.net\nAdoption fee $350\n\nJoin us for a \"Meet N Greet\" Saturday April 14th from 10 am til 2pm where you can meet some of our adoptables. To be held at:\nKi Tracks\n5067 W Oines Rd\nOregon, IL\nNo on site adoptions unless pre-approved to adopt.\n\n\n","contact":{"phone":"","state":"IL","address1":"PO Box 544","address2":"","email":"CauseForPawsRescue@gmail.com","city":"Byron","zip":"61010","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41363882/1/?bust=1523303662&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41363882/1/?bust=1523303662&width=300&-pn.jpg"]},{"ownerid":2,"name":"Razor","type":"Dog","primarybreed":"Chow Chow","sex":"M","age":"Adult","description":"razor came to contented critters with a Lab puppy after their owner passed away. Razor has not gotten along with other dogs we have tried him with. So at this point , he would need to be introduced to a second dog on a trial basis. He is very people friendly. Likes attention and is very gentle in his actions. He is quite a \"talker\" . (that does not mean BARKER)..He is good sized and built like a tank. He is a nice boy. Unsure about cats or other pets.\nHe has been vet checked and neutered and vaccinated. Update: still here, still waiting..\nUpdate 5/1/14..Razor is still with us, and after getting to know him, he is such a character. LOVES TO PLAY..races around like a nut, loves his ball and plays fetch. He loves snacks and attention. Razor likes everyone EXCEPT OTHER DOGS! He really is a nice guy\nUpdate July 22 /14. Razor is fast becoming a favorite with all the staff. He is goofy and fun. He is however quite the hunter. Squirrels and mice do not last long if they get in Razors pen. He really needs a home of his own. He is a good boy.\nUPDATE 11/23/14. I Just KNOW there is someone out there for this guy. He is one of my favorites, he has been with us tooo long. He needs a home of his own and I would probably guess with his hunting skills, that cats might not be an option for Razors family ... We will just keep looking.","contact":{"phone":"218-638-2153  ","state":"MN","address1":"P.O. Box 385","address2":"","email":"girfish@gmail.com","city":"Makinen","zip":"55763","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/28046741/1/?bust=1386616383&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/28046741/1/?bust=1386616383&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/28046741/2/?bust=1421684861&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/28046741/2/?bust=1421684861&width=300&-pn.jpg"]},{"ownerid":1,"name":"Chocolate","type":"Cat","primarybreed":"Domestic Short Hair","sex":"M","age":"Senior","description":"Chocolate is an eight year old out-going and friendly boy. He is very sweet, and enjoys attention and petting. Chocolate is a curious boy who likes to investigate his surroundings. He was recently surrendered to us along with Midnight. Therefore he is cat friendly, and might enjoy sharing a home with an existing pet in the home. Even though he's only been with us a few days, he is handling it well. Chocolate is an extremely nice cat, and would make a great addition to most any home.","contact":{"phone":"856-401-1300","state":"NJ","address1":"125 County House Rd","address2":"","email":"info@ccasnj.org","city":"Blackwood","zip":"08012","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/21055214/1/?bust=1520991204&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/21055214/1/?bust=1520991204&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/21055214/2/?bust=1520991204&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/21055214/2/?bust=1520991204&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/21055214/3/?bust=1520991205&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/21055214/3/?bust=1520991205&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/21055214/4/?bust=1520991206&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/21055214/4/?bust=1520991206&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/21055214/5/?bust=1520991206&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/21055214/5/?bust=1520991206&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/21055214/6/?bust=1520991206&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/21055214/6/?bust=1520991206&width=300&-pn.jpg"]},{"ownerid":3,"name":"RUTH","type":"Dog","primarybreed":"Labrador Retriever","sex":"F","age":"Adult","contact":{"phone":"(512)-978-0500 ","state":"TX","address1":"7201 Levander Loop","address2":"","email":"animal.customerservice@austintexas.gov","city":"Austin","zip":"78702","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41307971/1/?bust=1523166785&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41307971/1/?bust=1523166785&width=300&-pn.jpg"]},{"ownerid":5,"name":"Bexley","type":"Dog","primarybreed":"Australian Shepherd","sex":"F","age":"Young","description":"Bexley is a 7mth old spayed female Aussie/ Cur mix. She weighs 45 lbs. Bexley is just an awesome dog. She has the biggest heart and just wants to be loved by someone. She is sit close to your legs and just lean against you to have contact with you. She is so very gentle. This dog has great potential and just needs someone to give her a chance. She is great with children and other dogs. She is up to date on shots and wormed.  She is already spayed.  The adoption fee is $125.  If interested in meeting this cutie, please email heritagefarms08@gmail.com or call the foster  at 248-670-0668 . She is being fostered in Holly, Michigan.  When emailing please include information about you and your family including other pets.","contact":{"phone":"419-591-6621    ","state":"OH","address1":"P.O. Box 402","address2":"","email":"heritagefarms08@gmail.com","city":"Liberty Center","zip":"43532","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41056093/1/?bust=1519703064&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41056093/1/?bust=1519703064&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41056093/2/?bust=1519703070&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41056093/2/?bust=1519703070&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41056093/3/?bust=1519703079&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41056093/3/?bust=1519703079&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41056093/4/?bust=1519703090&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41056093/4/?bust=1519703090&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41056093/5/?bust=1519703101&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41056093/5/?bust=1519703101&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41056093/6/?bust=1519703133&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41056093/6/?bust=1519703133&width=300&-pn.jpg"]},{"ownerid":2,"name":"COURTESY LISTING - Spot & Lollie","type":"Dog","primarybreed":"Coonhound","sex":"M","age":"Young","description":"Spot and Lollie are Coonhound/American bulldog mixes and come from the same litter. They are 2 years old. Their vaccinations are up-to-date. Spot has been neutered, Lollie has been spayed. They are used to being outside and have been used to having an underground fence. They do well with this, and they need lots of room to play! They are good with children, but the male dog \"Spot\" will jump some. They are both playful and sweet. \n\nFor adoption information contact Amber ambeyd1979@rocketmail.com or or 336-902-4022.","contact":{"phone":"(336) 838-9588","state":"NC","address1":"P O Box 306","address2":"208 S. Bridge St., Wilkesboro NC","email":"hsowcritters@gmail.com","city":"North Wilkesboro","zip":"28659","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41106092/1/?bust=1520270383&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41106092/1/?bust=1520270383&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41106092/2/?bust=1520270393&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41106092/2/?bust=1520270393&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41106092/3/?bust=1520270407&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41106092/3/?bust=1520270407&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41106092/4/?bust=1520270412&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41106092/4/?bust=1520270412&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41106092/5/?bust=1520270423&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41106092/5/?bust=1520270423&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41106092/6/?bust=1520270433&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41106092/6/?bust=1520270433&width=300&-pn.jpg"]},{"ownerid":2,"name":"PATIENCE","type":"Cat","primarybreed":"Domestic Short Hair","sex":"F","age":"Young","contact":{"phone":"281-275-A-DOG (2364)  ","state":"TX","address1":"101 Gillingham","address2":"","email":"kketchum@sugarlandtx.gov","city":"Sugar Land","zip":"77487","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/40565895/1/?bust=1514940286&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40565895/1/?bust=1514940286&width=300&-pn.jpg"]},{"ownerid":2,"name":"Angelica","type":"Dog","primarybreed":"Labrador Retriever","sex":"F","age":"Adult","description":"âMature woman seeks loving family to call her own. Must come equipped with plenty of treats (especially if they are peanut butter-flavored), a warm bed and the energy to give plenty of back scratches and belly rubs. Must appreciate Country music and the slight Southern drawl/bark that will permeate your household. Bonus points if the family is open to letting her bring all of her Dolly Parton records home with her.\n\nPlease send all interested inquiries to adoptions@adoptadog.org or (914) 273-1674 and the nice woman who answers the phone will tell you more about Angelica (7 y.o. DSF or âDog Seeking Familyâ)â.\n\n","contact":{"phone":"914-273-1674","state":"CT","address1":"","address2":"","email":"adoptions@adoptadog.org","city":"Greenwich","zip":"06831","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/38114990/1/?bust=1495289867&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38114990/1/?bust=1495289867&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38114990/2/?bust=1500086802&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38114990/2/?bust=1500086802&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38114990/3/?bust=1500086802&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38114990/3/?bust=1500086802&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38114990/4/?bust=1500086812&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38114990/4/?bust=1500086812&width=300&-pn.jpg"]},{"ownerid":4,"name":"Izzy","type":"Dog","primarybreed":"German Shepherd Dog","sex":"F","age":"Adult","description":"Izzy is a smaller german shepherd mix, 40 lb, smart, attentive and sweet with a lot of expression on her face. She looks you straight in the eye and knows exactly what you want to say before you said it. \n\nIzzy comes from unknown situation, she is heartworm positive, she is expected to fully recover.\n\nShe does fine with the other dogs, especially smaller and non-assertive dogs. However she needs to be properly introduced as she might feel uneasy at first with the larger dogs.\n\nIzzy is calm, agreeable, obedient and will be deeply attached to her human. \n\nIf interested, please fill out the application at http://sannicoladogrescue.com/dogadoptionform.aspx. \n\nLet us know if you'd rather prefer for us to send you the appliciation questions.\n\n","contact":{"phone":"(720) 381-7358","state":"CO","address1":"","address2":"","email":"sannicoladogrescue@gmail.com","city":"Westminster","zip":"80021","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41263224/1/?bust=1522097297&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41263224/1/?bust=1522097297&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41263224/2/?bust=1522097336&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41263224/2/?bust=1522097336&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41263224/3/?bust=1522097382&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41263224/3/?bust=1522097382&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41263224/4/?bust=1522097476&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41263224/4/?bust=1522097476&width=300&-pn.jpg"]},{"ownerid":2,"name":"Rosie","type":"Cat","primarybreed":"Tuxedo","sex":"F","age":"Adult","description":"Rosalita is a beautiful, sweet and playful kitty who loves to play and cuddle.  \n\nShe's extremely loving and loves to be pet and rub her head into the palm of your hand! \n\n Please email us for an application for this darling cat.  \n\nThanks!","contact":{"phone":"","state":"CA","address1":"","address2":"","email":"rachellegros@me.com","city":"Beverly Hills","zip":"90212","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/19717521/1/?bust=1521315690&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/19717521/1/?bust=1521315690&width=300&-pn.jpg"]},{"ownerid":2,"name":"Wendell","type":"Dog","primarybreed":"Border Collie","sex":"M","age":"Adult","description":"Are you looking for a laid back, go with the flow kind of dog? Let me introduce you to Wendell. Wendell is a 2 year old Border Collie Mix. He is incredibly sweet and as laid back as they come. He loves other dogs and absolutely adores human attention. He is a low maintenance dog and is just happy to be along for the ride in this crazy thing called life. Wendell is currently undergoing slow kill heartwormtreatment. Wendell is up to date on vaccinations, neutered, and ready to curl up in that empty spot on your couch! He actually was adopted for 8 months with a family who then decided to kick him to the curb. They dropped him off at a shelter who immediately contacted us. When we picked him up it was obvious he was filthy and had lived a while outside, he was also OBESE. Our fun peppy lil pup was just sad. He is now in an awesome foster and learning to be happy and trust again. He does well with dogs, cats, small animals, he is crate trained and house trained, he also knows basic commands. This lil man is the total package, an absolute GEM. Whoever adopts him will need to continue with his slow kill treatment as well as continue helping him to reach his healthy weight goals! Apply today to adopt this sweet boy!","contact":{"phone":"","state":"NE","address1":"PO Box 592","address2":"","email":"Highplainspaw@gmail.com","city":"Sidney","zip":"69162","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/40777492/1/?bust=1516958975&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40777492/1/?bust=1516958975&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40777492/2/?bust=1516958975&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40777492/2/?bust=1516958975&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40777492/3/?bust=1516958976&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40777492/3/?bust=1516958976&width=300&-pn.jpg"]},{"ownerid":2,"name":"Harry","type":"Dog","primarybreed":"Hound","sex":"M","age":"Baby","description":"I am looking for that special someone to adopt me and give me a forever home. If youre interested in adopting me, please visit our website and fill out the adoption form online at http://bdrr.org/adoption-form; Or contact Big Dog Ranch Rescue by Phone: (561) 791-6465 or (561) 309-3311; by Email: adoptions@bdrr.org ","contact":{"phone":"(561) 791-6465","state":"FL","address1":"14444 Okeechobee Blvd.","address2":"Loxahatchee, FL 33470","email":"adoptions@bdrr.org","city":"Loxahatchee","zip":"33470","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41103523/1/?bust=1520462250&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41103523/1/?bust=1520462250&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41103523/2/?bust=1520462255&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41103523/2/?bust=1520462255&width=300&-pn.jpg"]},{"ownerid":2,"name":"Lilly","type":"Dog","primarybreed":"Hound","sex":"F","age":"Young","description":"~ I might do best in a single family home because I have a houndy bark. ~ I am a great dog with lots of potential. ~ I want to live with kids over 16* age. ~ I have not had much experience with cats or dogs but may be willing to consider sharing my home with a furry friend. ","contact":{"phone":"203-227-4137","state":"CT","address1":"455 Post Road East","address2":"","email":"","city":"Westport","zip":"06880","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41391635/1/?bust=1523594611&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41391635/1/?bust=1523594611&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41391635/2/?bust=1523594612&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41391635/2/?bust=1523594612&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41391635/3/?bust=1523594613&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41391635/3/?bust=1523594613&width=300&-pn.jpg"]},{"ownerid":2,"name":"Linden","type":"Dog","primarybreed":"Pit Bull Terrier","sex":"F","age":"Adult","description":"Lovable Linden! This gentle girl (DOB 2/2016) is searching for a forever family to love. Is that yours? Linden is a ready made companion who loves new toys and treats. She is spayed, micro-chipped, and vaccinated. She walks well on a leash and enjoys being with people and other dogs. Her adoption fee is just $50 dollars because she is sponsored by Melissa Hamner, requires a fully fenced yard, and that you live within 45 minutes of Toledo. For an adoption application, email pitcrewapplication@gmail.com","contact":{"phone":"","state":"OH","address1":"855 North McCord","address2":"","email":"pitcrewapplication@gmail.com","city":"Toledo","zip":"43615","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41231634/1/?bust=1521682150&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41231634/1/?bust=1521682150&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41231634/2/?bust=1521682158&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41231634/2/?bust=1521682158&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41231634/3/?bust=1521682170&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41231634/3/?bust=1521682170&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41231634/4/?bust=1521682178&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41231634/4/?bust=1521682178&width=300&-pn.jpg"]},{"ownerid":2,"name":"ABRAHAM","type":"Dog","primarybreed":"Pit Bull Terrier","sex":"M","age":"Young","contact":{"phone":"314-615-0650","state":"MO","address1":"10521 Baur Boulevard","address2":"","email":"","city":"Olivette","zip":"63132","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41410315/1/?bust=1523789821&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41410315/1/?bust=1523789821&width=300&-pn.jpg"]},{"ownerid":5,"name":"DJ","type":"Dog","primarybreed":"Dalmatian","sex":"F","age":"Young","description":"HI!  My name is DJ.  I'm a young dalmatian mix girl, probably mixed with Cattle Dog (aka queensland heeler, blue healer), who ended up stray in the high kill Hesperia shelter.  Luckily Rescue saw me and rescued me before something bad happened.  Whew!  It was one scary place!  I'm now living with a group of dogs in a kennel , and loving life as you can see from my photos.  I'm a bit shy but I love my daily walks and hanging out with my bff, Domino, a big dalmatian bull terrier.  I also love flirting with the other male dogs in the yard during play time .. they all think I'm so pretty!   I am dog and people friendly, walk nicely on leash and am well behaved in the car. Because I am shy, i would be best suited for a quiet low key home, with or without another dog.  I am spayed and have all my shots so I am ready to go home anytime you call for me  Couldn't you make room in your home and your heart for a pretty spotty faced girl like me?\n\nIf you are interested in me, please contact Dalmatian Rescue of Southern California, Inc. by  phone at 949/374-1002  or for a quicker response, email the Rescue directly at dalrescue@sbcglobal.net.  Submission of an application starts the adoption process and upon approval, arrangements can be quickly made for you and your family to come meet me and my other k9 buddies available for adoption from Dalmatian Rescue of Southern California, Inc.    I would love to meet you, so please contact Dalmatian Rescue and ask about me as soon as you can!\n\nTo learn more about Dalmatian Rescue of Southern California, Inc., a 501c3 non-profit charity, and to see all of our available dogs, please visit our website at www.dalrescuesocal.com.  You can also visit us on facebook at www.facebook.com/spottyfriends.  We love to hear your stories and see your pictures of your spotted friends.  Thanks!","contact":{"phone":"(949) 374-1002","state":"CA","address1":"20301 Riverside Dr.","address2":"www.dalrescuesocal.com","email":"dalrescue@sbcglobal.net","city":"Newport Beach","zip":"92660","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/32850493/1/?bust=1491347052&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/32850493/1/?bust=1491347052&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/32850493/2/?bust=1438026671&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/32850493/2/?bust=1438026671&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/32850493/3/?bust=1491347053&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/32850493/3/?bust=1491347053&width=300&-pn.jpg"]},{"ownerid":1,"name":"Nitro","type":"Dog","primarybreed":"Labrador Retriever","sex":"M","age":"Adult","description":"Nitro is about a year old. He is good with other animals though he is very energetic and would be best if the other animals were active. Nitro loves to play fetch.","contact":{"phone":"828-863-4444","state":"NC","address1":"989 Little Mountain Rd","address2":"","email":"adopt@foothillshumanesociety.org","city":"Columbus","zip":"28722","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/37123651/1/?bust=1498519548&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/37123651/1/?bust=1498519548&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/37123651/2/?bust=1498519549&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/37123651/2/?bust=1498519549&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/37123651/3/?bust=1498519549&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/37123651/3/?bust=1498519549&width=300&-pn.jpg"]},{"ownerid":4,"name":"Posey","type":"Dog","primarybreed":"Black Mouth Cur","sex":"F","age":"Baby","contact":{"phone":"(844) 336-7283","state":"TX","address1":"PO Box 790","address2":"","email":"info@saverescue.org","city":"Santa Fe","zip":"77517","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41289669/1/?bust=1522386749&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41289669/1/?bust=1522386749&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41289669/2/?bust=1522386751&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41289669/2/?bust=1522386751&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41289669/3/?bust=1522386752&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41289669/3/?bust=1522386752&width=300&-pn.jpg"]},{"ownerid":2,"name":"Daisy Lou","type":"Dog","primarybreed":"Labrador Retriever","sex":"F","age":"Young","description":"Daisy Lou-Lab/Pointer X female,  ~ 2 yr (March 2017)\nDaisy Lou is a sweet girl, taken in by a kind family.  Due to busy lives\nand many dogs, they are  not able to keep Daisy Lou.  She's been\nliving in a home, with the other dogs and children. Is a sweet girl.\nShe would just as soon not share her food, her only fault that is known.\nShe may be best in a home as the only pet.\nDaisy Lou is estimated to be about 2 yr. old and is housetrained. Her\nadoption fee is $275 to help cover the medical costs of getting ready\nfor adoption. \n    For our online application, please email rescuebc@hotmail.com\nInclude your location and a phone number for future communication.    ","contact":{"phone":"Please Email for Inquiries","state":"MD","address1":"","address2":"","email":"RescueBC@hotmail.com","city":"Germantown","zip":"20874","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/37741832/1/?bust=1490891437&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/37741832/1/?bust=1490891437&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/37741832/2/?bust=1490891438&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/37741832/2/?bust=1490891438&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/37741832/3/?bust=1490891439&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/37741832/3/?bust=1490891439&width=300&-pn.jpg"]},{"ownerid":2,"name":"Ms. Kitty","type":"Cat","primarybreed":"Siamese","sex":"F","age":"Adult","description":"1/30/18: Meet Ms. Kitty. She is about 3.5 years old and a Torti Point Siamese mix (no papers). She was rescued from Craigslist where she was listed as \"free to a good home\". She was the much loved only pet of an older lady who passed away leaving her homeless. Having been an only pet her whole life she isn't a big fan of other cats or dogs, she must be an only pet. She has beautiful big blue eyes and elegant fur! Kitty likes feather toys and tummy rubs, but can be a bit shy with people she doesn't know.  She is spayed, up to date on all medical and microchipped.\n\nIf you are interested in adopting her, please use the following link for our online adoption application: https://ww04.elbowspace.com/secure/20120214123524751639\n\nPlease note: Our mailing address is a PO Box and not a physical location to meet or view cats/kittens. All our cats/kittens are in foster homes and can be seen at weekly adoption events.\n","contact":{"phone":"1-732-773-0809","state":"NJ","address1":"1001 Fischer Blvd.","address2":"P.O Box","email":"callingallcatsrescues@gmail.com","city":"Toms River","zip":"08753","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/40827095/1/?bust=1517432489&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40827095/1/?bust=1517432489&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40827095/2/?bust=1520951733&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40827095/2/?bust=1520951733&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40827095/3/?bust=1517432582&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40827095/3/?bust=1517432582&width=300&-pn.jpg"]},{"ownerid":2,"name":"COOKIE","type":"Dog","primarybreed":"Australian Cattle Dog / Blue Heeler","sex":"F","age":"Adult","description":"Cookie is a beautiful Aussie/Heeler Mix. She is a playful, eager to please girl who is ready to find that forever home to call her own. Cookie gets along great with  all other nonaggressive dogs. She is great with kids as well. \nShe has been fixed, vaccinated fully, microchipped and heartworm negative. She would love a home with another dog to play with if possible but she wouldn't mind being the only spoiled rotten baby either. Cookie is crate trained and does very well in the house when let out regularly. Adoption fee $200 through Astasia's Angels Animal Rescue","contact":{"phone":"469-766-6336  ","state":"TX","address1":"","address2":"","email":"astasiasangelsar@gmail.com","city":"Wylie","zip":"75098","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/39683486/1/?bust=1509312365&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39683486/1/?bust=1509312365&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39683486/2/?bust=1509312365&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39683486/2/?bust=1509312365&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39683486/3/?bust=1509312366&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39683486/3/?bust=1509312366&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/39683486/4/?bust=1509312366&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/39683486/4/?bust=1509312366&width=300&-pn.jpg"]},{"ownerid":1,"name":"Bubba","type":"Dog","primarybreed":"Chihuahua","sex":"M","age":"Senior","contact":{"phone":"215-750-3100  ","state":"PA","address1":"3839 Richlieu Rd.","address2":"PO Box 1470","email":"adoptions@womenshumanesociety.org","city":"Bensalem","zip":"19020","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41180085/1/?bust=1522388117&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41180085/1/?bust=1522388117&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41180085/2/?bust=1522388122&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41180085/2/?bust=1522388122&width=300&-pn.jpg"]},{"ownerid":3,"name":"Pebbles","type":"Cat","primarybreed":"Domestic Short Hair","sex":"M","age":"Baby","description":"Sweet, highly energetic, very playful\n\nI was rescued with my mom cat and my three siblings from a hording situation and abandonment.\n\nIt was by a miracle we were rescued from becoming stray cats and even worse!\n\nMy foster mom says, \" I am too cute and a lot of fun.\" I have talent in redecorating.\n\nEveryday, I rearrange my cat bed and blankets. --I get bored with the same look.\n\nSo, I can do that for you and be your sweet playful, forever friend.\n\nI love hanging out with my mom cat. I play by myself, too. \n\nI also, get along well with the other cats in my foster home and they love \nto play with me.\n\nI am waiting for my loving, compassionate forever pet parent(s).\n\nDOB - December 2017\n","contact":{"phone":"","state":"CA","address1":"","address2":"","email":"apawsitiveapproach2015@gmail.com","city":"Anaheim","zip":"92805","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41175953/1/?bust=1521046470&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41175953/1/?bust=1521046470&width=300&-pn.jpg"]},{"ownerid":4,"name":"Gilly","type":"Dog","primarybreed":"Black Mouth Cur","sex":"F","age":"Baby","description":"Litter found under a house with deceased mother.  Raised on surrogate and bottle.  Breeds unknown.","contact":{"phone":"(979) 279-6388","state":"TX","address1":"402 3rd Street","address2":"","email":"seachicken1954@yahoo.com","city":"Hearne","zip":"77859","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/40758433/1/?bust=1516803769&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40758433/1/?bust=1516803769&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40758433/2/?bust=1516803778&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40758433/2/?bust=1516803778&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/40758433/3/?bust=1516803780&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/40758433/3/?bust=1516803780&width=300&-pn.jpg"]},{"ownerid":2,"name":"ANNABELLE","type":"Cat","primarybreed":"Tuxedo","sex":"F","age":"Adult","description":"ANNABELLE is  a pretty name for a pretty girl, donât you agree?  I am a 3-year old gray and white tuxedo female with golden eyes.  Those are my best physical features, but my very best feature is my loving, sweet personality.  I was surrendered by my first owner and that made me sad. Now Iâm meeting new people and  hoping to make a good bond with someone special.   If you have been waiting for a special girl to share your life, come to the shelter and meet me today!","contact":{"phone":"260-244-6664 ","state":"IN","address1":"951 S. Line Street","address2":"","email":"director@hswc.org","city":"Columbia City","zip":"46725","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/41038753/1/?bust=1519488333&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41038753/1/?bust=1519488333&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/41038753/2/?bust=1519488389&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/41038753/2/?bust=1519488389&width=300&-pn.jpg"]},{"ownerid":5,"name":"Walley","type":"Cat","primarybreed":"Domestic Short Hair","sex":"M","age":"Adult","description":"Loves Other Cats!!Walley is part of a litter that was rescued from a feral colony shortly after their mama weaned them. Very ill, they would've surely died without our intervention though this is not usually recommended.\nWalley is a sweetheart and he bonds thoroughly with the other cats in the home. He is always cuddled up with or hanging onto another cat as if his life depended on it! But, they don't seem to mind. He would not be happy as an only cat.\nWally probably needs a home without dogs or small shrieky children as well. Older children would be fine. Born on 3/15/14, Walley is up to date on his vaccinations and neutered. He and his litter mates are FIV & FeLV negative.\nIf you would like to submit an application, please do so here: http://desotoanimalrescue.org/cat-adoption-application.html or if you'd like more information, please call 662-342-9448. 4/7/18 2:01 PM","contact":{"phone":"662-342-9448 ","state":"MS","address1":"P.O. Box 316","address2":"","email":"info@desotoanimalrescue.org","city":"Horn Lake","zip":"38637","fax":""},"imagelink":["http://photos.petfinder.com/photos/pets/38398839/1/?bust=1497086725&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38398839/1/?bust=1497086725&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38398839/2/?bust=1497086725&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38398839/2/?bust=1497086725&width=300&-pn.jpg","http://photos.petfinder.com/photos/pets/38398839/3/?bust=1497086725&width=500&-x.jpg","http://photos.petfinder.com/photos/pets/38398839/3/?bust=1497086725&width=300&-pn.jpg"]}]